Revit 2026 API

# UVMultiply Method

---

Multiplies this 2-D vector by the specified value and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV Multiply(
	double value
)
```
```vb
Public Function Multiply (
	value As Double
) As UV
```
```cpp
public:
UV^ Multiply(
	double value
)
```
```fsharp
member Multiply :
        value : float -> UV
```

#### Parameters

value Double
    The value to multiply with this vector.

#### Return Value

UVThe multiplied 2-D vector.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified value is an infinite number. |

The multiplied vector is obtained by multiplying each coordinate of this vector by the specified value.

#### Reference

UV Class

Autodesk.Revit.DB Namespace